{
  "name": "Structur: Gantt SANDBOX",
  "license": "private",
  "image": "//meta-q.cdn.bubble.io/f1737740098491x571427207526609150/Structur%20Icon.svg",
  "description": "Structur's Gantt chart JS is a robust, interactive plugin for creating modern Gantt charts in your application. \n\nLeveraging the powerful Frappe Gantt library, it allows seamless integration with dynamic data, enabling task drag-and-drop, resizing, and progress tracking. It supports customizable views (day, week, month), task dependencies, and interactive popups for detailed information. \n\nPerfect for visualizing project timelines, this plugin offers flexibility and customization with clean, responsive layouts, making project management intuitive and efficient.",
  "link": "",
  "demo_page": "",
  "categories": {
    "0": "calendar",
    "1": "chart",
    "2": "analytics",
    "3": "productivity"
  },
  "data_tracked": false,
  "plugin_instructions": "Plugin Documentation: https://pebble-floor-e12.notion.site/Martech-Gantt-Chart-Documentation-175acf715f6980aa8c16cb0dc6f7b985?pvs=4\n\nDemo Editor: https://bubble.io/page?id=test-app-for-alex&tab=Design&name=test-gantt&type=page\n\nDemo Preview: https://test-app-for-alex.bubbleapps.io/version-test/test-gantt\n\n# Overview\n\nThe Martech: Gantt Chart JS Plugin is a powerful tool to add interactive Gantt chart functionality to your [Bubble.io](http://bubble.io/) app. It supports task management, drag-and-drop scheduling, and customizable styling to fit your app's design.\n\n---\n\n# How to use\n\n- **Add the Gantt Chart Element**\n    - Drag the Gantt Chart JS element onto your Bubble page.\n- **Set Up Your Data**\n    - Use a data type (e.g., \"Gantt Tasks\") with fields such as:\n        - Task Name\n        - Start Date\n        - End Date\n        - Completion Date\n        - Description (optional)\n        - Subtask IDs (text, concatenated or list of unique IDs)\n- **Configure the Plugin**\n    - Map fields like task name, progress, description, start date, end date, and subtask IDs.\n    - Choose the view mode (day, week, or month).\n- **Customize Settings**\n    - Enable/disable features like progress dragging, tooltips, drag handles, table controls, and polylines.\n    - Style various chart elements, including colors, fonts, and tooltips.\n- **Update and Refresh**\n    - Use the plugin’s events and actions to dynamically manage tasks, such as updating task dates or progress.\n    - Refresh the chart after changes using the `Refresh Gantt Chart` action.\n\n---\n\n# Components\n\n### Actions\n\n- **Refresh Gantt Chart**: Updates the chart to reflect the latest data from your Bubble app.\n\n### Elements\n\n### GanttChartJS\n\nThis is the main element of the plugin and supports:\n\n- **Data Mapping:** Map fields like ID, name, progress, start/end dates, description, and subtasks.\n- **View Modes:** Choose between day, week, or month views.\n- **Settings:** Control task dragging, tooltips, styling, and more.\n\n### Events\n\n### `Gantt Chart Task Date Changed`\n\n- Triggered when a task's start or end date changes.\n- Passes the task ID and updated dates.\n\n### `Gantt Chart Task Clicked`\n\n- Triggered when a task is clicked.\n- Returns the task's unique ID and associated data.\n\n### `Gantt Chart Task Progress Updated`\n\n- Triggered when task progress is adjusted.\n- Returns the task ID and the new progress value.",
  "data_tracked_description": null
}